STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_RCP_Cli_Cmd/STM32_WPAN/App/app_thread.c
                          Send_CLI_To_M0();
#else
                          
			  memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			  memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "ifconfig down\n\r", 15);
			  ThreadCliCmdBuffer.cmdserial.cmd.plen = 15;
			  ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			  /* Clear receive buffer, character counter and command complete */
			  CptReceiveCmdFromUser = 0;
			  indexReceiveChar = 0;
			  TL_CLI_SendCmd();
#endif /* ENABLE_OPENTHREAD_CLI */
			  break;
		  }

                  JoinerState = 1;
#ifdef ENABLE_OPENTHREAD_CLI
                  indexReceiveChar = 13;
		  memcpy(CommandString, "ifconfig up\n\r", indexReceiveChar);

                  Send_CLI_To_M0();
#else
		  memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
		  memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "ifconfig up\n\r", 13);
		  ThreadCliCmdBuffer.cmdserial.cmd.plen = 13;
		  ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;

		  /* Clear receive buffer, character counter and command complete */
		  CptReceiveCmdFromUser = 0;
		  indexReceiveChar = 0;

		  TL_CLI_SendCmd();
#endif /* ENABLE_OPENTHREAD_CLI */
		  break;

		case 1 : /* ifconfig in progress */
		  joinerIPv6IfUp = TRUE;
                  JoinerState = 0xF2;
#ifdef ENABLE_OPENTHREAD_CLI
                  indexReceiveChar = 22;
		  memcpy(CommandString, "joiner start STM32WB\n\r", indexReceiveChar);
                  
                  Send_CLI_To_M0();
#else
                  memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
		  memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "joiner start STM32WB\n\r", 22);
		  ThreadCliCmdBuffer.cmdserial.cmd.plen = 22;
		  ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;

		  /* Clear receive buffer, character counter and command complete */
		  CptReceiveCmdFromUser = 0;
		  indexReceiveChar = 0;

		  TL_CLI_SendCmd();
#endif /* ENABLE_OPENTHREAD_CLI */
		  /* Start slow Blinking */
		  HW_TS_Start(joinerTimerID, (uint32_t)SLOW_BLINK_TIMEOUT);

		  break;
		case 2 : /* joining in progress */
			break;
		case 3 : /* joining over and OK */
			BSP_LED_On(LED1);
			JoinerState = 4;
			break;
		case 0x0F : /* joining Error case */
			HW_TS_Stop(joinerTimerID);
    		while(l_BlinkCpt--) {
				BSP_LED_Toggle(LED1);
				HAL_Delay(50U);
			  }
				BSP_LED_Off(LED1);
				JoinerState = 0;
			break;

		default :
			break;
	} //switch
}
/* USER CODE END FD_WRAP_FUNCTIONS */
